dataset_gen/Earlier_Datasets/OpenFoam/design_points/design_point_1/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-7.47524
-7.47541
-7.47557
-7.47572
-7.47586
-7.476
-7.47613
-7.47625
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-5.5124
-5.52573
-5.53847
-5.55062
-5.56217
-5.57307
-5.58332
-5.59292
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
-7.5
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
7.5
7.5
7.5
7.5
7.5
7.5
7.5
7.5
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
7.3125
6.9375
6.5625
6.1875
5.8125
5.4375
5.0625
4.6875
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
7.3125
6.9375
6.5625
6.1875
5.8125
5.4375
5.0625
4.6875
...
)
;
    }
}


// ************************************************************************* //
